Tasks/Задачи_ПКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>Задачи_ПКД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеСвойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНеВыполненыхВопросовЧекЛиста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Композиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КороткаяСрочнаяЗадача</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбобщеннаяЗадача</Name>
					<Comment>Совместно с композицией</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПересогласованиеКомпозиции</v8:Type>
						<v8:Type>cfg:TaskRef.ПринятьТЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наблюдатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЧекЛист</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвторВыполнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодчиненыеЗадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвторПостановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияЗадачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтадияЗадачи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/Задачи_ПКД/Ext/ManagerModule.bsl
Функция ДействияНаСервере(Действие, Знач мКомплектыДляАналогичногоДействия, Знач Задача, ТипЗадачи, Исполнитель = Неопределено, Параметр = Неопределено) Экспорт
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;
	ОбъектЗадачаИзменен = Ложь;
	
	ОбъектЗадача 		= Задача.ПолучитьОбъект();
	ОбъектЗадача.Дата 	= ТекущаяДата(); 
	
	стДанные 			= Неопределено;
	
	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьОбщиеЗадачи(Задача);
	ИначеЕсли Действие = "СбросКонструктором" Тогда
		ОбъектЗадачаИзменен = омСтадииКомплекта.УстановитьСтатусСУчетомГлобальныхНастроек(ОбъектЗадача, Действие);
	ИначеЕсли Действие = "НачатьВыполнение" Тогда
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ВРаботеКонструктора, Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
	ИначеЕсли Действие = "Приостановить" Тогда
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПриостановкаКонструктором, Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
	ИначеЕсли Действие = "ЗавершениеРаботы" Тогда
		ОбъектЗадачаИзменен = омСтадииКомплекта.УстановитьСтатусСУчетомГлобальныхНастроек(ОбъектЗадача, Действие);
	ИначеЕсли Действие = "ДоработкаВедущийКонструктор" Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Конструктор;
		ОбъектЗадача.Исполнитель 	= Конструктор;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, ОбъектЗадача.СтатусЗадачи
			, ОбъектЗадача.ТипЗадачи, , Истина);
		
	ИначеЕсли Действие = "КонтрольВедущийКонструктор" Тогда
		
		Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Дизайнер;
		ОбъектЗадача.Исполнитель 	= Дизайнер;
		
	ИначеЕсли Действие = "ДоработкаДизайнера" Тогда
		
		ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(Параметр).ВедущийКонструктор;
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ВедущийКонструктор;
		ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором, ВедущийКонструктор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		
	ИначеЕсли Действие = "ИзменитьДизайнер" Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Конструктор;
		ОбъектЗадача.Исполнитель 	= Конструктор;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, ВедущийКонструктор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		
	ИначеЕсли Действие = "КорректировкаДизайнер"  Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
		
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.Корректировка;
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Конструктор;
		ОбъектЗадача.Исполнитель 	= Конструктор;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		
	ИначеЕсли Действие = "КонтрольКП" Тогда
		
		Финдиректор = Справочники.Организации.ПолучитьФиндиректораОрганизации();
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Финдиректор;
		ОбъектЗадача.Исполнитель 	= Финдиректор;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеФиндиректором, Финдиректор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		
	ИначеЕсли Действие = "Согласовано" Тогда
		
		мКомплектыДляАналогичногоДействия.Очистить();
		ДействиеСогласовано(Задача);
		
	ИначеЕсли Действие = "ВозвратСЗапроса" Тогда
		
		Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Дизайнер;
		ОбъектЗадача.СтатусЗадачи 	= Перечисления.СтатусыЗадач.Запрос;
		ОбъектЗадача.Исполнитель 	= Дизайнер;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, , ОбъектЗадача.ТипЗадачи);
		
	ИначеЕсли Действие = "ВозвратССогласования" Тогда
		
		Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Дизайнер;
		ОбъектЗадача.СтатусЗадачи 	= Перечисления.СтатусыЗадач.Корректировка;
		ОбъектЗадача.Исполнитель 	= Дизайнер;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		
	ИначеЕсли Действие = "ОтменаИзделия" Тогда
		
		Финдиректор = Справочники.Организации.ПолучитьФиндиректораОрганизации();
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Отмена;
		ОбъектЗадача.СтатусЗадачи 	= Перечисления.СтатусыЗадач.Отмена;
		ОбъектЗадача.Выполнена		= Истина;
		ОбъектЗадача.Исполнитель 	= Финдиректор;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.Отмена, Финдиректор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		
	ИначеЕсли Действие = "СогласованоБезИзменений" Тогда
		
		Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Дизайнер;
		ОбъектЗадача.Исполнитель 	= Дизайнер;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, , ОбъектЗадача.ТипЗадачи);
		
	ИначеЕсли Действие = "СогласованоСИзменением" Тогда
		
		Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Дизайнер;
		ОбъектЗадача.Исполнитель 	= Дизайнер;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, , ОбъектЗадача.ТипЗадачи);
		
	КонецЕсли; 
	
	НаименованиеПараметра 	= "";
	МодульСчетчиков 		= Обработки.НастройкаДействий;
	ОбъектЗадачаИзменен 	= МодульСчетчиков.ИзменитьСчетчикСобытий(Задача, Действие, "ПКД", НаименованиеПараметра, Ложь); 

	Если мКомплектыДляАналогичногоДействия.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Задачи_ПКД.Ссылка КАК Задача
			|ИЗ
			|	Задача.Задачи_ПКД КАК Задачи_ПКД
			|ГДЕ
			|	Задачи_ПКД.ОбъектТЗ В(&ОбъектТЗ)";
			
		Запрос.УстановитьПараметр("ОбъектТЗ", мКомплектыДляАналогичногоДействия);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ПустойМассив = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			ДействияНаСервере(Действие, ПустойМассив, Выборка.Задача, ТипЗадачи, ОбъектЗадача.Исполнитель, Параметр);
		КонецЦикла;
		
	КонецЕсли;
	
	НовоеСостояние 	= Неопределено;
	НовыйТип 		= Неопределено;
	НовыЙСтатус 		= Неопределено;
	
	Если НЕ Действие = "Согласовано"  Тогда 
		
		Если стДанные = Неопределено Тогда
			НовыйТип 	= ОбъектЗадача.ТипЗадачи;
			НовыЙСтатус 	= ОбъектЗадача.СтатусЗадачи;
		Иначе
			
			ЗначениеИзменениеСчетчика = 0;
			
			Если НаименованиеПараметра = "НомерДоработка" Тогда
				ЗначениеИзменениеСчетчика = ЗначениеИзменениеСчетчика + 1;
			ИначеЕсли НаименованиеПараметра = "НомерКорректировка" Тогда
				ЗначениеИзменениеСчетчика = ЗначениеИзменениеСчетчика + 2;
			ИначеЕсли НаименованиеПараметра = "НомерИзменение" Тогда
				ЗначениеИзменениеСчетчика = ЗначениеИзменениеСчетчика + 4;
			КонецЕсли;
			
			стДанные.УвеличениеСчетчика = ЗначениеИзменениеСчетчика; 
			
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные); 
			
			НовоеСостояние 	= стДанные.Состояние;
			НовыйТип 		= стДанные.ТипЗадачи;
			НовыЙСтатус 		= стДанные.Статус;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ОбъектЗадачаИзменен Тогда
		
		ОбъектЗадача.Наименование = омЗадачиОбщие.ПолучитьНаименованиеЗадачи(Задача, НовыЙСтатус, НовыйТип, НовоеСостояние);
		ОбъектЗадача.Записать();
		
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
		
	КонецЕсли;
	
КонецФункции // ДействияНаСервере()

Процедура ДействиеСогласовано(Задача, Комментарий = "") Экспорт
	
	ОбъектЗадача = ЗавершитьЗадачуПКД(Задача, Комментарий);
	
	ТипыВнешнегоПроизводства = омВнешнееПроизводство.ТипВнешнегоПроизводства(ОбъектЗадача.ОбъектТЗ);
	
	Если ТипыВнешнегоПроизводства.РКД Тогда
		
		Если НЕ ЗначениеЗаполнено(ТипыВнешнегоПроизводства.ЗадачаВнешнегоПроизводства) Тогда
			омВнешнееПроизводство.СоздатьЗадачуВнешнегоПроизводства(ОбъектЗадача.ОбъектТЗ, ОбъектЗадача.Проект);
		КонецЕсли;
		
	Иначе
		
		Если ТипЗнч(ОбъектЗадача.ОбъектТЗ) = Тип("СправочникСсылка.ИзделияКомплект") Тогда
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
			СоздатьЗадачуРКД(ОбъектЗадача, Конструктор);
			
		Иначе
			
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(ОбъектЗадача.Ссылка);
			
			мКомплекты = омКомпозицииСервер.ПолучитьКомплектыКомпозиции(ОбъектЗадача.ОбъектТЗ);
			
			омЗадачиПКДСервер.КонтрольОтдельныхЗадачРКД(мКомплекты);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Задачи_ПКД.Ссылка КАК Задача,
			|	Пользователи.Ссылка КАК Конструктор
			|ИЗ
			|	Задача.Задачи_ПКД КАК Задачи_ПКД
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В (&Комплект)) КАК ДанныеКомплектаСрезПоследних
			|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО (ДанныеКомплектаСрезПоследних.Конструктор = Пользователи.Сотрудник)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
			|		ПО Задачи_ПКД.ОбъектТЗ = ДатыКомплекта.Комплект
			|ГДЕ
			|	НЕ Задачи_ПКД.Выполнена
			|	И НЕ ЕСТЬNULL(ДатыКомплекта.РКД_отдельно_от_композиции, ЛОЖЬ)";
			
			Запрос.УстановитьПараметр("Комплект", мКомплекты);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ОбъектЗадача = ЗавершитьЗадачуПКД(Выборка.Задача, Комментарий);
				СоздатьЗадачуРКД(ОбъектЗадача, Выборка.Конструктор);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

Функция ЗавершитьЗадачуПКД(СсылкаНаЗадачу, Комментарий = "")

	ОбъектЗадача 				= СсылкаНаЗадачу.ПолучитьОбъект();
	ОбъектЗадача.Дата 			= ТекущаяДата();
	ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Завершение;
	ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.ЗавершенаЗадача;
	ОбъектЗадача.Выполнена      = Истина;
	ОбъектЗадача.Комментарий	= Комментарий;
	
	ОбъектЗадача.Записать(); 
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПустаяСсылка(), ОбъектЗадача.Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(СсылкаНаЗадачу, стДанные);

	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(СсылкаНаЗадачу);

	Возврат ОбъектЗадача;
	
КонецФункции

Процедура СоздатьЗадачуРКД(ОбъектЗадача, Конструктор, СтатусЗадачи = Неопределено, ТипЗадачи = Неопределено, СостоянияЗадач = Неопределено) Экспорт
	
	Если ТипЗнч(ОбъектЗадача) = Тип("СправочникСсылка.ИзделияКомплект") Тогда
		ОбъектТЗ = ОбъектЗадача;	
	Иначе
		ОбъектТЗ = ОбъектЗадача.ОбъектТЗ;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		
		ЗадачаРКД = Задачи.Задачи_РКД.СоздатьЗадачу();
		
	Иначе
		
		Пока Выборка.Следующий() Цикл
			ЗадачаРКД = Выборка.Ссылка.ПолучитьОбъект();
			ЗадачаРКД.Выполнена = Ложь;
		КонецЦикла;
		
	КонецЕсли;
	
	ЗадачаРКД.Дата 				= ТекущаяДата();
	ЗадачаРКД.Исполнитель 		= Конструктор;
	ЗадачаРКД.Дата 				= ТекущаяДата();
	ЗадачаРКД.ОбъектТЗ 			= ОбъектТЗ;
	ЗадачаРКД.Основание 		= ОбъектТЗ.Ссылка;
	ЗадачаРКД.Проект 			= ОбъектТЗ.Проект;
	ЗадачаРКД.СтатусЗадачи		= ?(СтатусЗадачи 	= Неопределено, Перечисления.СтатусыЗадач.РазработкаРКД, 			СтатусЗадачи);
	ЗадачаРКД.ТипЗадачи			= ?(ТипЗадачи 		= Неопределено, Перечисления.ТипыЗадачКонструирования.Конструктор, 	ТипЗадачи);
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;
	СостояниеЗадач 		= ?(СостоянияЗадач = Неопределено, Перечисления.СостоянияЗадач.ОжиданиеКонструктором, СостоянияЗадач);	
	
	стДанные 				= МенеджерРегистра.ПолучитьСтруктуруДанных(СостояниеЗадач, Конструктор, ЗадачаРКД.СтатусЗадачи, ЗадачаРКД.ТипЗадачи);
	ЗадачаРКД.Наименование	= омЗадачиОбщие.ПолучитьНаименованиеЗадачи(ЗадачаРКД.Ссылка, ЗадачаРКД.СтатусЗадачи, ЗадачаРКД.ТипЗадачи, , ЗадачаРКД.ОбъектТЗ);
	
	ЗадачаРКД.Записать();
	
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ЗадачаРКД.Ссылка, стДанные);
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(ЗадачаРКД.Ссылка);
	
КонецПроцедуры
